src/СРМ/src/Catalogs/УчетныеЗаписиОповещений/УчетныеЗаписиОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиОповещений</name>
  <attributes>
    <name>Канал</name>
    <type>
      <types>EnumRef.КаналыОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиRocketChat</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/Enums/КаналыОповещений/КаналыОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КаналыОповещений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>RocketChat</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Catalogs/УчетныеЗаписиОповещений/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КаналПриИзменении(Элемент)
	УстановитьОрганичениеТиповНастройки();
КонецПроцедуры

&НаСервере
Процедура УстановитьОрганичениеТиповНастройки()
	Если Объект.Канал=Перечисления.КаналыОповещений.Email Тогда
		ОписаниеТипов=Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты");
	ИначеЕсли Объект.Канал=Перечисления.КаналыОповещений.RocketChat Тогда
		ОписаниеТипов=Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиRocketChat");
	Иначе
		ОписаниеТипов=Новый ОписаниеТипов;
	КонецЕсли;
	Элементы.Настройка.ОграничениеТипа=ОписаниеТипов;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОрганичениеТиповНастройки();
КонецПроцедуры
